List<String> duaes = [
  'اللهم آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار', // Dua 1
  'اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل، والجبن، وضلع الدين، وغلبة الرجال', // Dua 2
  'سبحانك اللهم ربنا وبحمدك اللهم اغفر لي', // Dua 3
  'يا مقلب القلوب ثبت قلبي على دينك', // Dua 4
  'اللهم إنك عفو تحب العفو فاعف عني', // Dua 5
  'اللهم اغفر لي ذنبي كله دقه وجله، وأوله وآخره وعلانيته وسره', // Dua 6
  'اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر', // Dua 7
  'اللهم اغفر لي خطيئتي وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي، وخطئي وعمدي، وكل ذلك عندي، اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، وأنت على كل شيء قدير', // Dua 8
  'اللهم إني أسألك الهدى والتقى، والعفاف والغنى', // Dua 9
  'اللهم إني أسألك أني أشهد أنك أنت الله، لا إله إلا أنت، الأحد الصمد، الذي لم يلد ولم يولد، ولم يكن له كفوا أحد', // Dua 10
  'اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل، والجبن، وضلع الدين، وغلبة الرجال', // Dua 11
  'اللهم إني أسألك من خير ما أمرت به وأعوذ بك من شر ما أمرت به', // Dua 12
  'اللهم إني أسألك من كل خير خزائنه بيدك، وأعوذ بك من كل شر خزائنه بيدك', // Dua 13
  'اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا -يعني فتنة الدجال- وأعوذ بك من عذاب القبر', // Dua 14
  'اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك', // Dua 15
  'اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل', // Dua 16
  'اللهم اجعل في قلبي نورا، وفي بصري نورا، وفي سمعي نورا، وعن يميني نورا، وعن يساري نورا، وفوقي نورا، وتحتي نورا، وأمامي نورا، وخلفي نورا، واجعل لي نورا', // Dua 17
  'اللهم أحسنت خلقي فأحسن خلقي', // Dua 18
  'اللهم احفظني بالإسلام قائما، واحفظني بالإسلام قاعدا، واحفظني بالإسلام راقدا، ولا تشمت بي عدوا ولا حاسدا', // Dua 19
  'اللهم أحيني ما كانت الحياة خيرا لي، وتوفني إذا كانت الوفاة خيرا لي', // Dua 20
  'اللهم أعنا على شكرك وذكرك، وحسن عبادتك', // Dua 21
  'اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك', // Dua 22
  'اللهم إني أعوذ بك من الفقر، والقلة، والذلة، وأعوذ بك من أن أظلم، أو أظلم', // Dua 23
];
